In [2]:
import pandas as pd 
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv")
df

  tickers        eps  revenue price      people
0  google      27.82       87   845  larry page
1     WMT       4.61      484   484        n.a.
2    MSFT         -1       85    85  bill gates
3     Ril  not avail       50    50      Ambani
4    TATA        5.6       -1  n.a.  ratan data

<font size="6">lets see what we have to do if we have an extra header as follows

In [4]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",skiprows=1)
df

  google      27.82   87   845  larry page
0    WMT       4.61  484   484        n.a.
1   MSFT         -1   85    85  bill gates
2    Ril  not avail   50    50      Ambani
3   TATA        5.6   -1  n.a.  ratan data

<font size="8">we can we have skipped the first row

In [5]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",header=1)
df

  google      27.82   87   845  larry page
0    WMT       4.61  484   484        n.a.
1   MSFT         -1   85    85  bill gates
2    Ril  not avail   50    50      Ambani
3   TATA        5.6   -1  n.a.  ratan data

<font size="7">we can also skip first rows by using header argument

In [6]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",header=2)
df

    WMT       4.61  484 484.1        n.a.
0  MSFT         -1   85    85  bill gates
1   Ril  not avail   50    50      Ambani
2  TATA        5.6   -1  n.a.  ratan data

<font size="6">we can skip two rows by giving header=2

In [7]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",header=None)
df

         0          1        2      3           4
0  tickers        eps  revenue  price      people
1   google      27.82       87    845  larry page
2      WMT       4.61      484    484        n.a.
3     MSFT         -1       85     85  bill gates
4      Ril  not avail       50     50      Ambani
5     TATA        5.6       -1   n.a.  ratan data

<font size="5">we can observe that header=None gives top column with ranged numbers

In [8]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [11]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",header=None,names=["stock","stock1","stock2","stock3","stock4"])
df

     stock     stock1   stock2 stock3      stock4
0  tickers        eps  revenue  price      people
1   google      27.82       87    845  larry page
2      WMT       4.61      484    484        n.a.
3     MSFT         -1       85     85  bill gates
4      Ril  not avail       50     50      Ambani
5     TATA        5.6       -1   n.a.  ratan data

<font size="5">from above we can see that we can add names to header rows

In [12]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv")
df

  tickers        eps  revenue price      people
0  google      27.82       87   845  larry page
1     WMT       4.61      484   484        n.a.
2    MSFT         -1       85    85  bill gates
3     Ril  not avail       50    50      Ambani
4    TATA        5.6       -1  n.a.  ratan data

In [16]:
df.head(3)

  tickers    eps  revenue price      people
0  google  27.82       87   845  larry page
1     WMT   4.61      484   484        n.a.
2    MSFT     -1       85    85  bill gates

In [18]:
df[2:5]

  tickers        eps  revenue price      people
2    MSFT         -1       85    85  bill gates
3     Ril  not avail       50    50      Ambani
4    TATA        5.6       -1  n.a.  ratan data

In [21]:
df[['tickers','price']]

  tickers price
0  google   845
1     WMT   484
2    MSFT    85
3     Ril    50
4    TATA  n.a.

<font size="5">inspite of this methods we can use follwing to selecr our required rows and columns

In [22]:
df = pd.read_csv("D:\\data science\\pandas\\csv\\stock.csv",na_values={"eps":["not avail"],
                                                                      "revenue":[-1],"price":["n.a."],
                                                                      "people":["n.a."]})
df

  tickers    eps  revenue  price      people
0  google  27.82     87.0  845.0  larry page
1     WMT   4.61    484.0  484.0         NaN
2    MSFT  -1.00     85.0   85.0  bill gates
3     Ril    NaN     50.0   50.0      Ambani
4    TATA   5.60      NaN    NaN  ratan data

<font size="5">lets talk about writing csv files

In [23]:
df.to_csv("D:\\data science\\pandas\\csv\\new.csv")

<font size="5">this is writing a new csv file

In [24]:
df.to_csv("D:\\data science\\pandas\\csv\\new.csv",index=False )

<##csv file without index>

In [27]:
df.to_csv("D:\\data science\\pandas\\csv\\new.csv",columns=["tickers","eps"],index=False)